#ifndef M_ACTOR_H
#define M_ACTOR_H

#include "types.h"
#include "m_actor_type.h"
#include "game.h"
#include "m_lib.h"
#include "m_lights.h"
#include "m_collision_bg.h"
#include "m_collision_obj.h"
#include "m_actor_dlftbls.h"
#include "libforest/gbi_extensions.h"

#ifdef __cplusplus
extern "C" {
#endif

typedef void (*mActor_proc)(ACTOR*, GAME*);
#define NONE_ACTOR_PROC ((mActor_proc)&none_proc1)

#define mAc_MAX_ACTORS 200

#define ACTOR_STATE_NONE 0
#define ACTOR_STATE_0 (1 << 0)
#define ACTOR_STATE_2 (1 << 2)
#define ACTOR_STATE_NO_MOVE_WHILE_CULLED (1 << 4)
#define ACTOR_STATE_NO_DRAW_WHILE_CULLED (1 << 5)
#define ACTOR_STATE_NO_CULL (1 << 6)
#define ACTOR_STATE_INVISIBLE (1 << 7)
#define ACTOR_STATE_TA_SET (1 << 11)
#define ACTOR_STATE_LIGHTING (1 << 22) // does lighting NOT affect this actor?
#define ACTOR_STATE_24 (1 << 24)
#define ACTOR_STATE_25 (1 << 25)
#define ACTOR_STATE_26 (1 << 26)
#define ACTOR_STATE_27 (1 << 27)
#define ACTOR_STATE_28 (1 << 28)
#define ACTOR_STATE_CAN_MOVE_IN_DEMO_SCENES (1 << 29)
#define ACTOR_STATE_IN_DEMO (1 << 30)

// TODO: Name the unique ones for their correspondant actor

typedef enum bank_id {
    ACTOR_OBJ_BANK_NONE,
    ACTOR_OBJ_BANK_1,
    ACTOR_OBJ_BANK_2,
    ACTOR_OBJ_BANK_KEEP,
    ACTOR_OBJ_BANK_BGITEM,
    ACTOR_OBJ_BANK_ROOM_SUNSHINE,
    ACTOR_OBJ_BANK_6,
    ACTOR_OBJ_BANK_AIRPLANE,
    ACTOR_OBJ_BANK_8,
    ACTOR_OBJ_BANK_9,
    ACTOR_OBJ_BANK_10,
    ACTOR_OBJ_BANK_TRAINDOOR,
    ACTOR_OBJ_BANK_12,

    mAc_PROFILE_COUNT,
    mAc_PROFILE_GARAGARA,
    mAc_PROFILE_TAMAIRE_NPC0,
    mAc_PROFILE_TAMAIRE_NPC1,
    mAc_PROFILE_HATUMODE_NPC0,
    mAc_PROFILE_NPC_TOTAKEKE,
    mAc_PROFILE_COUNT02,
    mAc_PROFILE_HATUMODE_CONTROL,
    mAc_PROFILE_TAMA,
    mAc_PROFILE_KAGO,
    mAc_PROFILE_TURI,
    mAc_PROFILE_HOUSE_CLOCK,
    mAc_PROFILE_TUNAHIKI_CONTROL,
    mAc_PROFILE_TUNAHIKI_NPC0,
    mAc_PROFILE_TUNAHIKI_NPC1,
    mAc_PROFILE_KOINOBORI,
    mAc_PROFILE_BEE,
    mAc_PROFILE_NAMEPLATE,
    mAc_PROFILE_DUMP,
    mAc_PROFILE_ROPE,
    mAc_PROFILE_EV_DOZAEMON,
    mAc_PROFILE_WINDMILL,
    mAc_PROFILE_LOTUS,
    mAc_PROFILE_ANIMAL_LOGO,
    mAc_PROFILE_MIKANBOX,
    mAc_PROFILE_DOUZOU,
    mAc_PROFILE_NPC_RTC,
    mAc_PROFILE_TOUDAI,
    mAc_PROFILE_NPC_RESTART,
    mAc_PROFILE_NPC_MAJIN5,
    mAc_PROFILE_FUUSEN,
    mAc_PROFILE_EV_DOKUTU,
    mAc_PROFILE_DUMMY,
    mAc_PROFILE_NPC_CURATOR,
    mAc_PROFILE_MUSEUM,
    mAc_PROFILE_EV_GHOST,
    mAc_PROFILE_MUSEUM_PICTURE,
    mAc_PROFILE_185,
    mAc_PROFILE_MUSEUM_FISH,
    mAc_PROFILE_MUSEUM_INSECT,
    mAc_PROFILE_BRIDGE_A,
    mAc_PROFILE_ROOM_SUNSHINE_MUSEUM,
    mAc_PROFILE_NEEDLEWORK_INDOOR,
    mAc_PROFILE_ROOM_SUNSHINE_MINSECT,
    mAc_PROFILE_MUSEUM_FOSSIL,
    mAc_PROFILE_MURAL,
    mAc_PROFILE_AC_SIGN,
    mAc_PROFILE_ANT,
    mAc_PROFILE_NPC_SENDO,
    mAc_PROFILE_FLAG,
    mAc_PROFILE_PRESENT_DEMO,
    mAc_PROFILE_PRESENT_NPC,
    mAc_PROFILE_BOAT,
    mAc_PROFILE_BOAT_DEMO,
    mAc_PROFILE_COTTAGE_MY,
    mAc_PROFILE_COTTAGE_NPC,
    mAc_PROFILE_EV_SONCHO2,
    mAc_PROFILE_NPC_MASK_CAT,
    mAc_PROFILE_NPC_MASK_CAT2,
    mAc_PROFILE_RESET_DEMO,
    mAc_PROFILE_GO_HOME_NPC,
    mAc_PROFILE_MISIN,
    mAc_PROFILE_LIGHTHOUSE_SWITCH,
    mAc_PROFILE_MUSEUM_INDOOR,
    mAc_PROFILE_T_ANRIUM1,
    mAc_PROFILE_T_BISCUS1,
    mAc_PROFILE_T_BISCUS2,
    mAc_PROFILE_T_HASU1,
    mAc_PROFILE_T_HAT1,
    mAc_PROFILE_T_ZINNIA1,
    mAc_PROFILE_T_BISCUS3,
    mAc_PROFILE_T_BISCUS4,
    mAc_PROFILE_T_ZINNIA2,
    mAc_PROFILE_T_HAT2,
    mAc_PROFILE_T_HAT3,
    mAc_PROFILE_T_REI1,
    mAc_PROFILE_T_REI2,
    mAc_PROFILE_NPC_SHASHO,
    mAc_PROFILE_T_BAG1,
    mAc_PROFILE_T_BAG2,
    mAc_PROFILE_EV_CASTAWAY,
    mAc_PROFILE_T_COBRA1,
    mAc_PROFILE_BALLOON,
    mAc_PROFILE_NPC_SONCHO,
    mAc_PROFILE_APRILFOOL_CONTROL,
    mAc_PROFILE_EV_MAJIN,
    mAc_PROFILE_HARVEST_NPC0,
    mAc_PROFILE_HARVEST_NPC1,
    mAc_PROFILE_GROUNDHOG_CONTROL,
    mAc_PROFILE_EV_SPEECH_SONCHO,
    mAc_PROFILE_GROUNDHOG_NPC0,
    mAc_PROFILE_EV_TURKEY,
    mAc_PROFILE_GHOG,
    mAc_PROFILE_HTABLE,
    mAc_PROFILE_NPC_HEM,
    mAc_PROFILE_TENT,
    mAc_PROFILE_PTERMINAL,
    mAc_PROFILE_MSCORE_CONTROL,

    mAc_PROFILE_NUM
};

enum {
    mAc_HILITE_OPAQUE,
    mAc_HILITE_TRANSLUCENT,

    mAc_HILITE_NUM
};

#define mAc_CHK_HIT_WALL(actor, wall) ((actor)->bg_collision_check.result.hit_wall & (wall))
#define mAc_CHK_HIT_ATR_WALL(actor, wall) ((actor)->bg_collision_check.result.hit_attribute_wall & (wall))

/* sizeof(ACTOR_PROFILE) == 0x24 */
struct actor_profile_s {
    /* 0x00 */ s16 id;                  /* unique actor type ID */
    /* 0x02 */ u8 part;                 /* actor type, seemingly called 'part' */
    /* 0x04 */ u32 initial_flags_state; /* initial actor flag state */
    /* 0x08 */ mActor_name_t npc_id;    /* "world" npc id/name */
    /* 0x0A */ s16 obj_bank_id;         /* used with object exchange */
    /* 0x0C */ size_t class_size;       /* sizeof(ZZZ_ACTOR) */
    /* 0x10 */ mActor_proc ct_proc;     /* constructor */
    /* 0x14 */ mActor_proc dt_proc;     /* destructor */
    /* 0x18 */ mActor_proc mv_proc;     /* move */
    /* 0x1C */ mActor_proc dw_proc;     /* draw */
    /* 0x20 */ mActor_proc sv_proc;     /* save */
};

typedef void (*mActor_shadow_proc)(ACTOR*, LightsN*, GAME_PLAY*);

/* sizeof(Shape_Info) == 0x48 */
typedef struct actor_shape_info_s {
    /* 0x00 */ s_xyz rotation;
    /* 0x06 */ s16 unk_6;
    /* 0x08 */ f32 ofs_y;
    /* 0x0C */ mActor_shadow_proc shadow_proc;
    /* 0x10 */ f32 shadow_size_x;
    /* 0x14 */ f32 shadow_size_z;
    /* 0x18 */ f32 shadow_size_change_rate;
    /* 0x1C */ f32 shadow_alpha_change_rate;
    /* 0x20 */ int unk_20;
    /* 0x24 */ xyz_t* shadow_position;
    /* 0x28 */ int move_bg_idx;
    /* 0x2C */ u8 draw_shadow; /* TRUE = shadow is drawn, FALSE = shadow is not drawn */
    /* 0x2D */ u8 unk_2D;
    /* 0x2E */ u8
        force_shadow_position; /* TRUE = shadow's position is forcefully updated, FALSE = non-forcefully updated */
    /* 0x2F */ u8 unused_2F[0x48 - 0x2F];
} Shape_Info;

typedef struct actor_shadow_s {
    /* 0x00 */ xyz_t position;
    /* 0x0C */ f32 groundY;
    /* 0x10 */ f32 unk10;
    /* 0x14 */ f32 unk14;
    /* 0x18 */ f32 unk18;
    /* 0x1C */ f32 unk1C;
    /* 0x20 */ s16 unk20;
    /* 0x22 */ s16 unk22;
    /* 0x24 */ s16 unk24;
    /* 0x26 */ s16 unk26;
    /* 0x28 */ char pad28[0xC];
    /* 0x34 */ int unk34;
    /* 0x38 */ int kind;
} Shadow_Info;

/* sizeof(struct actor_s) == 0x174 */
struct actor_s {
    /* 0x000 */ s16 id; /* unique actor type ID */
    /* 0x002 */ u8 part;
    /* 0x003 */ u8 restore_fg; /* restores 'fgdata' according to restore_fgdata_all */
    /* 0x004 */ s16 scene_id;
    /* 0x006 */ mActor_name_t npc_id;
    /* 0x008 */ s8 block_x;
    /* 0x009 */ s8 block_z;
    /* 0x00A */ s16 move_actor_list_idx;          /* used in aBC_setupCommonMvActor */
    /* 0x00C */ PositionAngle home;               /* Home position & rotation */
    /* 0x020 */ u32 state_bitfield;               /* bitfield of current actor state */
    /* 0x024 */ s16 actor_specific;               /* actor specific temp data */
    /* 0x026 */ s16 data_bank_id;                 /* data bank id actor is in */
    /* 0x028 */ PositionAngle world;              /* World position & rotation */
    /* 0x03C */ xyz_t last_world_position;        /* previous actor world position */
    /* 0x048 */ PositionAngle eye;                /* actor "eyes" (head/lookat) world position & rotation */
    /* 0x05C */ xyz_t scale;                      /* actor size */
    /* 0x068 */ xyz_t position_speed;             /* actor movement velocity (see Actor_position_speed_set) */
    /* 0x074 */ f32 speed;                        /* movement speed */
    /* 0x078 */ f32 gravity;                      /* gravity acting on actor */
    /* 0x07C */ f32 max_velocity_y;               /* maximum y velocity possible due to gravity, usually -20.0f */
    /* 0x080 */ f32 ground_y;                     /* vertical position of ground underneath actor */
    /* 0x084 */ mCoBG_Check_c bg_collision_check; /* background object collision info with actor */
    /* 0x0B4 */ u8 unknown_b4;                    /* some sort of flag */
    /* 0x0B5 */ u8 drawn;               /* was drawn flag, TRUE = actor was drawn, FALSE = actor was not drawn */
    /* 0x0B6 */ s16 player_angle_y;     /* Y angle (yaw) between actor and player actor */
    /* 0x0B8 */ f32 player_distance;    /* distance between actor and player actor (squared magnitude) */
    /* 0x0BC */ f32 player_distance_xz; /* distance between actor and player actor on XZ plane (magnitude) */
    /* 0x0C0 */ f32 player_distance_y;  /* distance between actor and player actor on Y plane */
    /* 0x0C4 */ Status_c status_data;   /* collider info, lots of leftover stuff from OoT */
    /* 0x0DC */ Shape_Info shape_info;
    /* 0x124 */ xyz_t camera_position; /* camera position relative to actor position */
    /* 0x130 */ f32 camera_w;          /* camera projection W value */
    /* 0x134 */ f32 cull_width;
    /* 0x138 */ f32 cull_height;
    /* 0x13C */ f32 cull_distance;
    /* 0x140 */ f32 cull_radius;
    /* 0x144 */ f32 talk_distance;     /* maximum distance for talking to be triggered, default seems to be 55.0f */
    /* 0x148 */ u8 cull_while_talking; /* flag to disable actor drawing while talking */
    /* 0x149 */ u8 skip_drawing;       /* manual "do not draw" override flag only used by player umbrella actor */
    /* 0x14C */ ACTOR* parent_actor;
    /* 0x150 */ ACTOR* child_actor;
    /* 0x154 */ ACTOR* prev_actor;
    /* 0x158 */ ACTOR* next_actor;
    /* 0x15C */ mActor_proc ct_proc;  /* constructor */
    /* 0x160 */ mActor_proc dt_proc;  /* destructor */
    /* 0x164 */ mActor_proc mv_proc;  /* move */
    /* 0x168 */ mActor_proc dw_proc;  /* draw */
    /* 0x16C */ mActor_proc sv_proc;  /* save */
    /* 0x170 */ ACTOR_DLFTBL* dlftbl; /* display list function table */
};

#define mActor_NONE_PROC1 ((mActor_proc)none_proc1)

typedef struct actor_list_s {
    /* 0x00 */ int num_actors;
    /* 0x04 */ ACTOR* actor;
} Actor_list;

typedef struct actor_info_s {
    /* 0x00 */ int total_num;
    /* 0x04 */ Actor_list list[ACTOR_PART_NUM];
} Actor_info;

typedef struct actor_data_s {
    /* 0x00 */ s16 profile;
    /* 0x02 */ s_xyz position;
    /* 0x08 */ s_xyz rotation;
    /* 0x0E */ s16 arg;
} Actor_data;

extern void Actor_world_to_eye(ACTOR* actor, f32 eye_height);
extern void Actor_position_move(ACTOR* actor);
extern void Actor_position_speed_set(ACTOR* actor);
extern void Actor_position_moveF(ACTOR* actor);
extern int Actor_player_look_direction_check(ACTOR* actor, s16 angle, GAME_PLAY* play);
extern void Shape_Info_init(ACTOR* actor, f32 ofs_y, mActor_shadow_proc shadow_proc, f32 shadow_size_x,
                            f32 shadow_size_z);
extern void Actor_delete(ACTOR* actor);
extern int Actor_draw_actor_no_culling_check(ACTOR* actor);
extern int Actor_draw_actor_no_culling_check2(ACTOR* actor, xyz_t* camera_pos, f32 camera_w);
extern void Actor_info_ct(GAME* game, Actor_info* actor_info, Actor_data* player_data);
extern void Actor_info_dt(Actor_info* actor_info, GAME_PLAY* play);
extern void Actor_info_call_actor(GAME_PLAY* play, Actor_info* actor_info);
extern void Actor_info_draw_actor(GAME_PLAY* play, Actor_info* actor_info);
